# Lecture 29 merge on Key and column

In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [3]:
dframe1 = DataFrame({'key':['X','Z','Y','Z','X','X'],'data_set_1':np.arange(6)})

In [4]:
dframe1

   data_set_1 key
0           0   X
1           1   Z
2           2   Y
3           3   Z
4           4   X
5           5   X

In [5]:
dframe2 = DataFrame({'key':['Q','Y','Z'],'data_set_2':[1,2,3]})

In [6]:
dframe2

   data_set_2 key
0           1   Q
1           2   Y
2           3   Z

In [7]:
pd.merge(dframe1,dframe2)

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2

In [8]:
pd.merge(dframe1,dframe2, on='key')

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2

In [9]:
pd.merge(dframe1,dframe2, on='key',how='left')

   data_set_1 key  data_set_2
0           0   X         NaN
1           1   Z         3.0
2           2   Y         2.0
3           3   Z         3.0
4           4   X         NaN
5           5   X         NaN

In [10]:
pd.merge(dframe1,dframe2, on='key' ,how= 'right')

   data_set_1 key  data_set_2
0         1.0   Z           3
1         3.0   Z           3
2         2.0   Y           2
3         NaN   Q           1

In [11]:
pd.merge(dframe1, dframe2, on= 'key', how = 'outer')

   data_set_1 key  data_set_2
0         0.0   X         NaN
1         4.0   X         NaN
2         5.0   X         NaN
3         1.0   Z         3.0
4         3.0   Z         3.0
5         2.0   Y         2.0
6         NaN   Q         1.0

In [12]:
dframe3 = DataFrame({'key':['X','X','X','Y','Z','Z'],'data_set_3':range(6)})

In [13]:
dframe4 = DataFrame({'key':['Y','Y','X','X','Z'],'data_set_4':range(5)})

In [14]:
pd.merge(dframe3,dframe4)

   data_set_3 key  data_set_4
0           0   X           2
1           0   X           3
2           1   X           2
3           1   X           3
4           2   X           2
5           2   X           3
6           3   Y           0
7           3   Y           1
8           4   Z           4
9           5   Z           4

In [15]:
df_left = DataFrame({'key1':['SF','SF','LA'],'key2':['one','two','one'],'left_data':[10,20,30]})

In [16]:
df_right = DataFrame({'key1':['SF','SF','LA','LA'],
                      'key2':['one','one','one','two'],
                      'right_data':[40,50,60,70]})

In [17]:
df_left

  key1 key2  left_data
0   SF  one         10
1   SF  two         20
2   LA  one         30

In [18]:
df_right

  key1 key2  right_data
0   SF  one          40
1   SF  one          50
2   LA  one          60
3   LA  two          70

In [19]:
pd.merge(df_left, df_right,on=['key1','key2'],how='outer')

  key1 key2  left_data  right_data
0   SF  one       10.0        40.0
1   SF  one       10.0        50.0
2   SF  two       20.0         NaN
3   LA  one       30.0        60.0
4   LA  two        NaN        70.0

In [20]:
pd.merge()

TypeError: merge() takes at least 2 arguments (0 given)

# Lecture30 merge on index

In [21]:
dframe_left = DataFrame({'key':['X','Y','Z','X','Y'],'data':range(5)})

In [22]:
dframe_left

   data key
0     0   X
1     1   Y
2     2   Z
3     3   X
4     4   Y

In [23]:
df_right = DataFrame({'group_data':[10,20]},index=['X','Y'])

In [24]:
df_right

   group_data
X          10
Y          20

In [25]:
pd.merge(dframe_left, df_right,left_on='key',right_index=True)

   data key  group_data
0     0   X          10
3     3   X          10
1     1   Y          20
4     4   Y          20

In [26]:
df_left_hr = DataFrame({'key1':['SF','SF','SF','LA','LA'],
                       'key2':[10,20,30,20,30],
                       'data_set':np.arange(5)})

In [27]:
df_left_hr

   data_set key1  key2
0         0   SF    10
1         1   SF    20
2         2   SF    30
3         3   LA    20
4         4   LA    30

In [28]:
df_right_hr = DataFrame(np.arange(10).reshape(5,2),index=[['LA','LA','SF','SF','SF'],
                                                         [20,10,10,10,20]],
                       columns = ['col_1','col_2'])

In [29]:
df_right_hr

       col_1  col_2
LA 20      0      1
   10      2      3
SF 10      4      5
   10      6      7
   20      8      9

In [30]:
pd.merge(df_left_hr, df_right_hr, left_on = ['key1','key2'],right_index=True)

   data_set key1  key2  col_1  col_2
0         0   SF    10      4      5
0         0   SF    10      6      7
1         1   SF    20      8      9
3         3   LA    20      0      1

In [31]:
df_left.join(df_right)

  key1 key2  left_data  group_data
0   SF  one         10         NaN
1   SF  two         20         NaN
2   LA  one         30         NaN

# Lecture 31 - Concatenate  
- join dataframes and matrices together

In [33]:
arr1 = np.arange(9).reshape(3,3)

In [34]:
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [37]:
np.concatenate([arr1,arr1], axis =0)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [38]:
ser1 = Series([0,1,2],index=['T','U','V'])

ser = Series([3,4],index= ['X','Y'])

In [40]:
pd.concat([ser1,ser])

T    0
U    1
V    2
X    3
Y    4
dtype: int64

In [43]:
pd.concat([ser1,ser],axis=1)

     0    1
T  0.0  NaN
U  1.0  NaN
V  2.0  NaN
X  NaN  3.0
Y  NaN  4.0

In [44]:
pd.concat([ser1,ser],keys=['cat1','cat2'])

cat1  T    0
      U    1
      V    2
cat2  X    3
      Y    4
dtype: int64

In [45]:
dframe1 = DataFrame(np.random.randn(4,3),columns=['X','Y','Z'])
dframe2 = DataFrame(np.random.randn(3,3),columns=['Y','Q','X'])

In [46]:
pd.concat([dframe1,dframe2])

          Q         X         Y         Z
0       NaN  1.457172  0.609373  0.728765
1       NaN -1.370472  0.722721  0.872892
2       NaN -0.682275 -0.831227  0.504907
3       NaN -1.082007  1.502431  0.684898
0 -0.661226  0.773929  0.976946       NaN
1  0.158096  0.613760  1.271257       NaN
2  0.109549  0.424457  0.165703       NaN

In [47]:
pd.concat([dframe1,dframe2],ignore_index=True)

          Q         X         Y         Z
0       NaN  1.457172  0.609373  0.728765
1       NaN -1.370472  0.722721  0.872892
2       NaN -0.682275 -0.831227  0.504907
3       NaN -1.082007  1.502431  0.684898
4 -0.661226  0.773929  0.976946       NaN
5  0.158096  0.613760  1.271257       NaN
6  0.109549  0.424457  0.165703       NaN

# Lecture 32 Combining DataFrames

In [54]:
ser1 = Series([2,np.nan,4,np.nan,6,np.nan],
              index=['Q','R','S','T','U','V'])
ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [55]:
ser2 = Series(np.arange(len(ser1)),dtype=np.float64,
              index=['Q','R','S','T','U','V'])
ser2

Q    0.0
R    1.0
S    2.0
T    3.0
U    4.0
V    5.0
dtype: float64

In [52]:
Series(np.where(pd.isnull(ser1),ser2,ser1),index=ser1.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [56]:
ser1.combine_first(ser2)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [57]:
nan=np.nan
dframe_odds = DataFrame({'X':[1,nan,3,nan],
                        'Y':[nan,5,nan,7],
                        'Z':[nan,9,nan,11]})

In [58]:
dframe_evens = DataFrame({'X':[2,4,nan,6,8],
                         'Y': [nan,10,12,14,16]})

In [ ]:
dframe_odds.combine_first(dframe_evens)

# Lecture 33 Reshaping DataFrames

In [59]:
dframe1 = DataFrame(np.arange(8).reshape(2,4),
                   index=pd.Index(['LA','SF'],name='city'),
                   columns=pd.Index(['A','B','C','D'],name='letter'))

In [60]:
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [61]:
dframe_st = dframe1.stack()

dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int64

In [ ]:
ser1 = Series([0,1,2],index=['Q','X','Y'])

ser2 = Series([4,5,6],index=['X','Y','Z'])

In [62]:
dframe = pd.concat([ser1,ser2],keys=['Alpha','Beta'])

In [63]:
dframe

Alpha  Q    2.0
       R    NaN
       S    4.0
       T    NaN
       U    6.0
       V    NaN
Beta   Q    0.0
       R    1.0
       S    2.0
       T    3.0
       U    4.0
       V    5.0
dtype: float64

# Lecture 35 Pivoting

In [64]:
import pandas.util.testing as tm; tm.N =3

In [65]:
def unpivot(frame):
    N,K = frame.shape
    
    data = {'value': frame.values.ravel('F'),
           'variable': np.asarray(frame.columns).repeat(N),
           'date': np.tile(np.asarray(frame.index),K)}
    
    return DataFrame(data, columns=['date','variable','value'])
dframe = unpivot(tm.makeTimeDataFrame())

In [66]:
dframe

         date variable     value
0  2000-01-03        A  0.054359
1  2000-01-04        A  1.113925
2  2000-01-05        A  0.918099
3  2000-01-03        B -0.227401
4  2000-01-04        B  0.220675
5  2000-01-05        B -0.161802
6  2000-01-03        C  0.331620
7  2000-01-04        C  1.077640
8  2000-01-05        C  0.124683
9  2000-01-03        D -0.363759
10 2000-01-04        D  0.615310
11 2000-01-05        D -2.550092

In [68]:
dframe_piv = dframe.pivot('date', 'variable','value')
                           #rows, columns, fill_values

In [69]:
dframe_piv

variable           A         B         C         D
date
2000-01-03  0.054359 -0.227401  0.331620 -0.363759
2000-01-04  1.113925  0.220675  1.077640  0.615310
2000-01-05  0.918099 -0.161802  0.124683 -2.550092

# Lecture 35  Duplicates in Dataframes

In [71]:
dframe = DataFrame({'key1':['A']*2 + ['B']*3,
                   'key2':[2,2,2,3,3]})

dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [72]:
dframe.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [73]:
dframe.drop_duplicates()

  key1  key2
0    A     2
2    B     2
3    B     3

In [75]:
dframe.drop_duplicates(['key1'])

  key1  key2
0    A     2
2    B     2

In [76]:
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [ ]:
dframe.drop_duplicates(['key1'],take_last=True)

# Lecture 36 Mapping

In [77]:
dframe = DataFrame({'city':['Alma', 'Brian Head', 'Fox park'],
                   'altitude':[3158,3000,2762]})

In [78]:
dframe

   altitude        city
0      3158        Alma
1      3000  Brian Head
2      2762    Fox park

In [82]:
state_map = {'Alma':'Colorade', 'Brian Head':'Utah', 'Fox park':'Wyoming'}

In [83]:
dframe['state'] = dframe['city'].map(state_map)

In [84]:
dframe

   altitude        city     state
0      3158        Alma  Colorade
1      3000  Brian Head      Utah
2      2762    Fox park   Wyoming

In [89]:
birds = {'Colorade':'pigeon','Utah':'mosquito','Wyoming':'Flying Cat' }

In [90]:
dframe['stuff'] = dframe['state'].map(birds)

In [91]:
dframe

   altitude        city     state       stuff
0      3158        Alma  Colorade      pigeon
1      3000  Brian Head      Utah    mosquito
2      2762    Fox park   Wyoming  Flying Cat

# Lecture 37  Replace Values

In [92]:
ser1 = Series([1,2,3,4,1,2,3,4])

In [93]:
ser1.replace(1,'eat')

0    eat
1      2
2      3
3      4
4    eat
5      2
6      3
7      4
dtype: object

In [94]:
ser1.replace([1,4],[100,'frog'])

0     100
1       2
2       3
3    frog
4     100
5       2
6       3
7    frog
dtype: object

In [95]:
ser1.replace({4:np.nan})

0    1.0
1    2.0
2    3.0
3    NaN
4    1.0
5    2.0
6    3.0
7    NaN
dtype: float64

# Lecture 38 Renaming axis index

In [97]:
dframe = DataFrame(np.arange(12).reshape(3,4),
                  index = ['NY','LA','SF'],
                  columns=['A','B','C','D'])
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [100]:
dframe.index.map(str.lower)

array(['ny', 'la', 'sf'], dtype=object)

In [101]:
dframe.index = dframe.index.map(str.lower)

In [102]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [103]:
dframe.rename(index=str.title, columns=str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [104]:
dframe.rename(index={'ny':'NEW YORK'},
             columns={'A':'ALPHA'})

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

# Lecture 39 Binning

In [112]:
years = [1990,1991,1992, 2008,2012,2015,1987,1969,2013,2008,1999]

In [113]:
decade_bins = [1960,1970,1980,1990,2000,2010,2020]

In [114]:
decade_cat = pd.cut(years, decade_bins)

In [115]:
decade_cat

[(1980, 1990], (1990, 2000], (1990, 2000], (2000, 2010], (2010, 2020], ..., (1980, 1990], (1960, 1970], (2010, 2020], (2000, 2010], (1990, 2000]]
Length: 11
Categories (6, object): [(1960, 1970] < (1970, 1980] < (1980, 1990] < (1990, 2000] < (2000, 2010] < (2010, 2020]]

In [116]:
decade_cat.categories

Index([u'(1960, 1970]', u'(1970, 1980]', u'(1980, 1990]', u'(1990, 2000]',
       u'(2000, 2010]', u'(2010, 2020]'],
      dtype='object')

In [117]:
pd.value_counts(decade_cat)

(2010, 2020]    3
(1990, 2000]    3
(2000, 2010]    2
(1980, 1990]    2
(1960, 1970]    1
(1970, 1980]    0
dtype: int64

In [118]:
pd.cut(years,2,precision=1)

[(1969, 1992], (1969, 1992], (1969, 1992], (1992, 2015], (1992, 2015], ..., (1969, 1992], (1969, 1992], (1992, 2015], (1992, 2015], (1992, 2015]]
Length: 11
Categories (2, object): [(1969, 1992] < (1992, 2015]]

# Lecture 40 Outliers

In [119]:
np.random.seed(12345)

In [120]:
dframe = DataFrame(np.random.randn(1000,4))

In [121]:
dframe.head()

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570

In [122]:
dframe.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [123]:
col = dframe[0]

In [125]:
col.head()

0   -0.204708
1    1.965781
2    0.769023
3    0.274992
4   -2.001637
Name: 0, dtype: float64

In [126]:
col[np.abs(col)>3]

523   -3.428254
900    3.366626
Name: 0, dtype: float64

In [129]:
dframe[(np.abs(dframe)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [130]:
dframe[np.abs(dframe)>3] = np.sign(dframe)*3

In [131]:
dframe.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

# Lecture 41 Permutations

In [133]:
dframe = DataFrame(np.arange(16).reshape(4,4))

In [134]:
blender = np.random.permutation(4)

In [135]:
blender

array([1, 3, 2, 0])

In [136]:
dframe

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [137]:
dframe.take(blender)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [138]:
box = np.array([1,2,3])

In [ ]:
shaker = np.random.randint(0)